In [3]:
%load_ext sql
%sql sqlite:///People.db

In [4]:
import pandas as pd
import sqlite3

data = pd.read_csv ('Gradebook.csv')   
df = pd.DataFrame(data)

In [5]:
res_data =[i for i in df.columns]

In [ ]:
# %%sql
# create table grade(StudentID int IDENTITY (1,1), F_name varchar(20), L_name varchar(20) ,Grade int)

In [7]:
%%sql
Drop Table grade

 * sqlite:///People.db
Done.

[]

In [ ]:
 %%sql
 create table student(studentID int IDENTITY(1,1), name varchar(20), Age int, State varchar(2))

In [ ]:
%%sql
insert into student values(0,"sandeep", 20,"KY");
insert into student values(1,"sandeep", 30,"NH");
insert into student values(2,"giri", 10,"TN")

In [ ]:
 %%sql
 create table classes(name varchar(20), Age int, State varchar(2))

In [ ]:
%%sql
select * from student

In [ ]:
%%sql
ALTER TABLE student
ADD Email varchar(255);

In [ ]:
%%sql
select * from student

In [ ]:
%%sql
UPDATE student
SET name = "Chesky", Age = 23, State = "KY", Email = "cheskynd@gmail.com"
WHERE StudentID == 0;

In [ ]:
%%sql 
select * from student

In [ ]:
%%sql
select * from resto_scores